---
kind: type
id: T:Autodesk.Revit.DB.Lighting.InitialFluxIntensity
source: html/9c36e906-74c5-adc1-d147-42f65f0c9613.htm
---
# Autodesk.Revit.DB.Lighting.InitialFluxIntensity

This class encapsulates initial flux intensity calculation.

## Syntax (C#)
```csharp
public class InitialFluxIntensity : InitialIntensity
```